CSI API ETABS v1

# cPluginCallbackFinished Property

---

Indicates whether the plugin is finished

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    bool Finished { get; }

    ReadOnly Property Finished As Boolean
    	Get

    Dim instance As cPluginCallback
    Dim value As Boolean

    value = instance.Finished

    property bool Finished {
    	bool get ();
    }

    abstract Finished : bool with get

#### Return Value

Type: Boolean
True if the plugin is finished; else False

See Also

#### Reference

cPluginCallback Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com